---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeIterator.Reset
source: html/361100ca-8264-90ff-3287-8ad18e86547f.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```